### 📖 Terraform Plan (infra-io/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cgn_storage.azurerm_storage_account.cgn_storage will be updated in-place
  ~ resource "azurerm_storage_account" "cgn_storage" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01"
        name                               = "iopitncgnst01"
        tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02"
        name                                           = "io-p-itn-cgn-card-func-02"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
            # (34 unchanged attributes hidden)

          ~ application_stack {
              ~ node_version                = "20" -> "22"
                # (6 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-card-func-02] Health Check Failed" -> (known after apply)
      ~ name                     = "io-p-itn-cgn-card-func-02] Health Check Failed" -> "[io-p-itn-cgn-card-func-02] Health Check Failed" # forces replacement
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgncardstfn02] Low Availability"
        name                     = "[iopitncgncardstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-func-pep-02"
        name                          = "io-p-itn-cgn-card-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-func-blob-pep-02"
        name                          = "io-p-itn-cgn-card-func-blob-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-func-file-pep-02"
        name                          = "io-p-itn-cgn-card-func-file-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-func-queue-pep-02"
        name                          = "io-p-itn-cgn-card-func-queue-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-staging-func-pep-02"
        name                          = "io-p-itn-cgn-card-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgncardstfn02"
        name                               = "iopitncgncardstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
        id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgncardstfn02"
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-cgn-common-snet-01",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02"
        name                                           = "io-p-itn-cgn-merchant-func-02"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
            # (34 unchanged attributes hidden)

          ~ application_stack {
              ~ node_version                = "20" -> "22"
                # (6 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-merchant-func-02] Health Check Failed" -> (known after apply)
      ~ name                     = "io-p-itn-cgn-merchant-func-02] Health Check Failed" -> "[io-p-itn-cgn-merchant-func-02] Health Check Failed" # forces replacement
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnmerchantstfn02] Low Availability"
        name                     = "[iopitncgnmerchantstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-func-pep-02"
        name                          = "io-p-itn-cgn-merchant-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-func-blob-pep-02"
        name                          = "io-p-itn-cgn-merchant-func-blob-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-func-file-pep-02"
        name                          = "io-p-itn-cgn-merchant-func-file-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-func-queue-pep-02"
        name                          = "io-p-itn-cgn-merchant-func-queue-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-staging-func-pep-02"
        name                          = "io-p-itn-cgn-merchant-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnmerchantstfn02"
        name                               = "iopitncgnmerchantstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
        id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnmerchantstfn02"
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-cgn-common-snet-01",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02"
        name                                           = "io-p-itn-cgn-search-func-02"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
            # (34 unchanged attributes hidden)

          ~ application_stack {
              ~ node_version                = "20" -> "22"
                # (6 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-search-func-02] Health Check Failed" -> (known after apply)
      ~ name                     = "io-p-itn-cgn-search-func-02] Health Check Failed" -> "[io-p-itn-cgn-search-func-02] Health Check Failed" # forces replacement
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnsearchstfn02] Low Availability"
        name                     = "[iopitncgnsearchstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-func-pep-02"
        name                          = "io-p-itn-cgn-search-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-func-blob-pep-02"
        name                          = "io-p-itn-cgn-search-func-blob-pep-02"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-search-func-file-pep-02"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-search-func-file-pep-02"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsearchstfn02"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-search-func-queue-pep-02"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-search-func-queue-pep-02"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsearchstfn02"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-staging-func-pep-02"
        name                          = "io-p-itn-cgn-search-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsearchstfn02"
        name                               = "iopitncgnsearchstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
        id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsearchstfn02"
      ~ ip_rules                   = [
          - "94.164.72.171",
        ]
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-cgn-func-search-snet-01",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-support-func-01"
        name                                           = "io-p-itn-cgn-support-func-01"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "0.3.1" -> "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-support-func-01/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
            # (34 unchanged attributes hidden)

          ~ application_stack {
              ~ node_version                = "20" -> "22"
                # (6 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-support-func-01] Health Check Failed" -> (known after apply)
      ~ name                     = "io-p-itn-cgn-support-func-01] Health Check Failed" -> "[io-p-itn-cgn-support-func-01] Health Check Failed" # forces replacement
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnsupportstfn01] Low Availability"
        name                     = "[iopitncgnsupportstfn01] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-func-pep-01"
        name                          = "io-p-itn-cgn-support-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-func-blob-pep-01"
        name                          = "io-p-itn-cgn-support-func-blob-pep-01"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-func-file-pep-01"
        name                          = "io-p-itn-cgn-support-func-file-pep-01"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-func-queue-pep-01"
        name                          = "io-p-itn-cgn-support-func-queue-pep-01"
      ~ tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "4.1.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-staging-func-pep-01"
        name                          = "io-p-itn-cgn-support-staging-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsupportstfn01"
        name                               = "iopitncgnsupportstfn01"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.1" -> "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
        id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsupportstfn01"
      ~ ip_rules                   = [
          - "94.164.72.171",
        ]
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-cgn-common-snet-01",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 39 to change, 4 to destroy.

Warning: Argument is deprecated

  with azurerm_monitor_diagnostic_setting.itn_queue_diagnostic_setting,
  on storage_itn_alerts.tf line 5, in resource "azurerm_monitor_diagnostic_setting" "itn_queue_diagnostic_setting":
   5: resource "azurerm_monitor_diagnostic_setting" "itn_queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider
```

</details>
